jackeyjiang/STM32_DGUS/STM32_Demo/utilities/serialscreen/serialscreen.c
 /*******************************************************************************
 * 函数名称:DisplayPassWord                                                                 
 * 描    述:显示密码长度以*表示                                                     
 *                                                                               
 * 输    入:PassWordLen                                                                   
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年3月13日                                                                    
 *******************************************************************************/ 
void DisplayPassWord(char PassWordLen)
{
	char i=0;
	char temp[20]={0};  //存放串口数据的临时数组
	memcpy(temp,VariableWrite,sizeof(VariableWrite));
	temp[2]= PassWordLen+ 4; //  0x83 00 00 ****** 如果无密码显示则清空数据
	myunion.adress= password_show; 
  temp[4]= myunion.adr[1];
  temp[5]= myunion.adr[0];
	for(i=0;i<PassWordLen;i++) temp[i+6]='*';
	Uart3_Sent(temp,sizeof(temp)); 
}	
 /*******************************************************************************
 * 函数名称:DisplayAbnormal                                                               
 * 描    述:显示错误码                                                   
 *                                                                               
 * 输    入:abnomal_code 字符串                                                                  
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年3月13日                                                                    
 *******************************************************************************/ 
void DisplayAbnormal(char *abnomal_code)
{
	char i=0;
	char temp[20]={0};  //存放串口数据的临时数组
	memcpy(temp,VariableWrite,sizeof(VariableWrite));
	temp[2]= 7; //  数据长度为4位
	myunion.adress= erro_num; 
  temp[4]= myunion.adr[1];
  temp[5]= myunion.adr[0];
	for(i=0;i<4;i++) temp[i+6]=abnomal_code[i];
	Uart3_Sent(temp,sizeof(temp)); 	
}


 /*******************************************************************************
 * 函数名称:PageChange                                                                     
 * 描    述:发送切换图片命令                                                              
 *                                                                               
 * 输    入:page                                                                    
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年3月13日                                                                    
 *******************************************************************************/ 	
uint8_t pageunitil= 0;
void PageChange(char page)
{
		unsigned char temp[7]={0};
		memcpy(temp,RegisterWrite,sizeof(RegisterWrite));	
		temp[4]=	PIC_ID;	
	  temp[6]=  page;
		pageunitil = page;
		Uart3_Send(temp,sizeof(temp));
}
 /*******************************************************************************
 * 函数名称:ReadPage                                                                     
 * 描    述:读取当前页,数据处理在DealSeriAceptData中处理                                                           
 *                                                                               
 * 输    入:无                                                                    
 * 输    出:                                                                     
 * 返    回:                                                             
 * 修改日期:2014年6月24日                                                                    
 *******************************************************************************/ 	
void ReadPage(void)
{
		unsigned char temp[6]={0};
		memcpy(temp,RegisterRead,sizeof(RegisterRead));	
		temp[4]=	PIC_ID;	
		Uart3_Send(temp,sizeof(temp));
}

 /*******************************************************************************
 * 函数名称:MenuChange                                                                     
 * 描    述:根据返回的数据更新所选的菜单                                                         
 *                                                                               
 * 输    入:无                                                                    
 * 输    出:                                                                     
 * 返    回:                                                             
 * 修改日期:2014年6月24日                                                                    
 *******************************************************************************/ 	
void MenuChange(uint8_t MenuNO)
{
  switch(MenuNO)
  {
    case 0x00:
    {
      PageChange(Logo_interface);
      while(1);
    }break;
    case 0x01:
    {
      Menu_interface= Menu1st_interface;
      MealSet_interface= MealSet1st_interface;
      memcpy(sell_type,sell_type_1st,4);
    }break;
    case 0x02:
    {
      Menu_interface= Menu2nd_interface;
      MealSet_interface= MealSet2nd_interface;  
      memcpy(sell_type,sell_type_2nd,4);      
    }break;
    case 0x03:
    {
      Menu_interface= Menu3rd_interface;
      MealSet_interface= MealSet3rd_interface;   
      memcpy(sell_type,sell_type_3rd,4);        
    }break;
    case 0x04:
    {
      Menu_interface= Menu4th_interface;
      MealSet_interface= MealSet4th_interface;  
      memcpy(sell_type,sell_type_4th,4);         
    }break;
    case 0x05:
    {
      Menu_interface= Menu5th_interface;
      MealSet_interface= MealSet5th_interface;   
      memcpy(sell_type,sell_type_5th,4);     
    }break; 
    default:break;    
  }
}
 /*******************************************************************************
 * 函数名称:SetScreenRtc                                                                    
 * 描    述:读取当前页,数据处理在DealSeriAceptData中处理                                                           
 *                                                                               
 * 输    入:无                                                                    
 * 输    出:                                                                     
 * 返    回:                                                             
 * 修改日期:2014年6月24日                                                                    
 *******************************************************************************/ 	
void SetScreenRtc(void)
{
  RTC_TimeTypeDef RTC_TimeStructure;
  RTC_DateTypeDef RTC_DateStructure;
  unsigned char temp[13]={0};
  RTC_GetTime(RTC_Format_BCD, &RTC_TimeStructure);
	RTC_GetDate(RTC_Format_BCD, &RTC_DateStructure);
  memcpy(temp,rtc_write,13);
  temp[6]=  RTC_DateStructure.RTC_Year;
  temp[7]=  RTC_DateStructure.RTC_Month;
  temp[8]=  RTC_DateStructure.RTC_Date;
  temp[9]=  RTC_DateStructure.RTC_WeekDay;
  temp[10]= RTC_TimeStructure.RTC_Hours;
  temp[11]= RTC_TimeStructure.RTC_Minutes;
  temp[12]= RTC_TimeStructure.RTC_Seconds;
  Uart3_Send(temp,sizeof(temp));
}
 /*******************************************************************************
 * 函数名称:DispLeftMeal                                                                     
 * 描    述:在菜单选择界面显示各菜品所剩余的                                                           
 *                                                                               
 * 输    入:无                                                                   
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年3月13日                                                                    
 *******************************************************************************/ 	

void DispLeftMeal(void)
{
		uint8_t i;
	  unsigned char temp[8]={0};  //存放串口数据的临时指针
		for(i=0;i<4;i++)
		{
      memcpy(temp,VariableWrite,sizeof(VariableWrite));
      temp[2]= 5;
      myunion.adress= meal1st_left+i; //在基地址推移位置
      temp[4]= myunion.adr[1];
      temp[5]= myunion.adr[0];	
      temp[7]= DefineMeal[sell_type[i]-1].MealCount;//sell_type[i]存储的是四个菜品的ID			
			Uart3_Send(temp,sizeof(temp));	
		}
}
 /*******************************************************************************
 * 函数名称:CutDownDisp                                                                     
 * 描    述:显示倒计时60-0                                                          
 *                                                                               
 * 输    入:time                                                                 
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年3月13日                                                                    
 *******************************************************************************/ 	
void CutDownDisp(char time)
{
	  unsigned char temp[8]={0};
	  memcpy(temp,VariableWrite,sizeof(VariableWrite));
	  temp[2]= 5;
		myunion.adress= count_dowm; //在基地址推移位置
		temp[4]= myunion.adr[1];
		temp[5]= myunion.adr[0];
    temp[7]= time;	
		Uart3_Send(temp,sizeof(temp));	
}
 /*******************************************************************************
 * 函数名称:MealCostDisp                                                                     
 * 描    述:显示当前餐品应付的金额                                                          
 *                                                                               
 * 输    入:                                                                 
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年3月13日                                                                    
 *******************************************************************************/ 
unsigned char GetMealPrice(char meal_type,char count)
{
	char price= 0;
  switch(meal_type)
	{
		case 0x01:
		{
			price= price_1st*count;
		}break;
		case 0x02:
		{
      price= price_2nd*count;
		}break;
		case 0x03:
		{
      price= price_3rd*count;
		}break;
		case 0x04:
		{
      price= price_4th*count;
		}break;
		case 0x05:
		{
      price= price_5th*count;
		}break;
		case 0x06:
		{
      price= price_6th*count;
		}break;
		case 0x07:
		{
      price= price_7th*count;
		}break;
		case 0x08:
		{
      price= price_8th*count;
		}break;
    
		default:break;
	}
	return price;
}

