jackeyjiang/STM32_DGUS/STM32_Demo/utilities/serialscreen/serialscreen.c
 /*******************************************************************************
 * 函数名称:MealCostDisp                                                                     
 * 描    述:显示当前餐品应付的金额                                                          
 *                                                                               
 * 输    入:                                                                 
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年3月13日                                                                    
 *******************************************************************************/ 
void MealCostDisp(char meal_id,char meal_count)
{
	  unsigned char temp[8]={0};
	  memcpy(temp,VariableWrite,sizeof(VariableWrite));
	  temp[2]= 5;
		temp[5]= (0x31+(meal_id-1)*2); //钱币变量地址
    temp[7]= GetMealPrice(meal_id,meal_count);	
		Uart3_Send(temp,sizeof(temp));		
}
 /*******************************************************************************
 * 函数名称:ClearUserBuffer                                                                     
 * 描    述:清除用户选择数据                                                          
 *                                                                               
 * 输    入:无                                                                 
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年3月13日                                                                    
 *******************************************************************************/ 
void ClearUserBuffer(void)
{
	UserActMessageWriteToFlash.UserAct.MealType_1st=0;
	UserActMessageWriteToFlash.UserAct.MealType_2nd=0;
	UserActMessageWriteToFlash.UserAct.MealType_3rd=0;
	UserActMessageWriteToFlash.UserAct.MealType_4th=0;
	UserActMessageWriteToFlash.UserAct.MealCnt_1st=0;
	UserActMessageWriteToFlash.UserAct.MealCnt_1st_t=0;
	UserActMessageWriteToFlash.UserAct.MealCnt_2nd=0;
	UserActMessageWriteToFlash.UserAct.MealCnt_2nd_t=0;
	UserActMessageWriteToFlash.UserAct.MealCnt_3rd=0;
	UserActMessageWriteToFlash.UserAct.MealCnt_3rd_t=0;
	UserActMessageWriteToFlash.UserAct.MealCnt_4th=0;
	UserActMessageWriteToFlash.UserAct.MealCnt_4th_t=0;
	UserActMessageWriteToFlash.UserAct.MealCost_1st=0;
	UserActMessageWriteToFlash.UserAct.MealCost_2nd=0;
	UserActMessageWriteToFlash.UserAct.MealCost_3rd=0;
	UserActMessageWriteToFlash.UserAct.MealCost_4th=0;
	UserActMessageWriteToFlash.UserAct.MealID=0;
	UserActMessageWriteToFlash.UserAct.Meal_totoal=0;
	UserActMessageWriteToFlash.UserAct.Meal_takeout=0;
	UserActMessageWriteToFlash.UserAct.PayShould=0;
	UserActMessageWriteToFlash.UserAct.PayType=0;
  UserActMessageWriteToFlash.UserAct.PayForCoins=0;           //用户投入的硬币数	
	UserActMessageWriteToFlash.UserAct.PayForBills=0;           //用户投入的纸币数
	UserActMessageWriteToFlash.UserAct.PayForCards=0;           //用户应经刷卡的数
  UserActMessageWriteToFlash.UserAct.PayAlready=0;
  UserActMessageWriteToFlash.UserAct.MoneyBackShould=0;
  UserActMessageWriteToFlash.UserAct.MoneyBackAlready=0;
  UserActMessageWriteToFlash.UserAct.MoneyBack=0;
  UserActMessageWriteToFlash.UserAct.MoneyPayBack_Already=0;
  UserActMessageWriteToFlash.UserAct.MoneyPayBack_Already_1st=0;
  UserActMessageWriteToFlash.UserAct.MoneyPayBack_Already_2nd=0;  
}
 /*******************************************************************************
 * 函数名称:PutIntoShopCart                                                                     
 * 描    述:在选产界面将点击放入购物车之后的程序响应                                                        
 *                                                                               
 * 输    入:                                                                 
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年3月13日                                                                    
 *******************************************************************************/ 
void PutIntoShopCart(void)
{

  UserActMessageWriteToFlash.UserAct.MealCnt_1st= UserActMessageWriteToFlash.UserAct.MealCnt_1st_t;
  UserActMessageWriteToFlash.UserAct.MealCost_1st = GetMealPrice(UserActMessageWriteToFlash.UserAct.MealType_1st,UserActMessageWriteToFlash.UserAct.MealCnt_1st);

  UserActMessageWriteToFlash.UserAct.MealCnt_2nd=UserActMessageWriteToFlash.UserAct.MealCnt_2nd_t;
  UserActMessageWriteToFlash.UserAct.MealCost_2nd = GetMealPrice(UserActMessageWriteToFlash.UserAct.MealType_2nd,UserActMessageWriteToFlash.UserAct.MealCnt_2nd);

  UserActMessageWriteToFlash.UserAct.MealCnt_3rd=UserActMessageWriteToFlash.UserAct.MealCnt_3rd_t;
  UserActMessageWriteToFlash.UserAct.MealCost_3rd = GetMealPrice(UserActMessageWriteToFlash.UserAct.MealType_3rd,UserActMessageWriteToFlash.UserAct.MealCnt_3rd);

  UserActMessageWriteToFlash.UserAct.MealCnt_4th=UserActMessageWriteToFlash.UserAct.MealCnt_4th_t;
  UserActMessageWriteToFlash.UserAct.MealCost_4th = GetMealPrice(UserActMessageWriteToFlash.UserAct.MealType_4th,UserActMessageWriteToFlash.UserAct.MealCnt_4th);

	UserActMessageWriteToFlash.UserAct.Meal_totoal= +UserActMessageWriteToFlash.UserAct.MealCost_4th+UserActMessageWriteToFlash.UserAct.MealCnt_3rd+UserActMessageWriteToFlash.UserAct.MealCnt_2nd+UserActMessageWriteToFlash.UserAct.MealCnt_1st;
}	

 /*******************************************************************************
 * 函数名称:SettleAccounts                                                                 
 * 描    述:当按下结算按钮后的程序流程                                                                                                                        
 * 输    入:无                                                                 
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年3月13日                                                                   
 *******************************************************************************/ 
char Floor= 0; //作为有商品种类的层数
void SettleAccounts(void)
{
  PageChange(Acount_interface);//结算界面
  //显示硬币数
	VariableChage(payment_coin,UserActMessageWriteToFlash.UserAct.PayForCoins);
  //显示纸币数
	VariableChage(payment_bill,UserActMessageWriteToFlash.UserAct.PayForBills);
  //刷卡数
	VariableChage(payment_card,UserActMessageWriteToFlash.UserAct.PayForCards);
	OpenTIM7();
	//程序显示部分
	UserActMessageWriteToFlash.UserAct.PayShould= UserActMessageWriteToFlash.UserAct.MealCost_1st+UserActMessageWriteToFlash.UserAct.MealCost_2nd+UserActMessageWriteToFlash.UserAct.MealCost_3rd+UserActMessageWriteToFlash.UserAct.MealCost_4th;
	VariableChage(mealtotoal_cost,UserActMessageWriteToFlash.UserAct.PayShould);
}

