jackeyjiang/STM32_DGUS/STM32_Demo/utilities/serialscreen/serialscreen.c
 /*******************************************************************************
 * 函数名称:SyncMealNameDisp                                                                  
 * 描    述:数据同步时显示餐品名称                                                          
 *           根据ID 显示名称 ，根据floor 改变现实变量的地址                                                                    
 * 输    入:meal_id ,floor                                                               
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年3月13日                                                                    
 *******************************************************************************/ 							
void SyncMealNameDisp(uint8_t meal_id,uint8_t floor)							
{
	  char temp[30]={0};  //存放串口数据的临时数组
		memcpy(temp,VariableWrite,sizeof(VariableWrite));
		temp[2]= 17; //0x83 0x41 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00
		myunion.adress= sync_column1st_name+ floor*(0x0100); 
		temp[4]= myunion.adr[1];
		temp[5]= myunion.adr[0];
		switch(meal_id)
		{
			case 0x00:break;
			case 0x01:mystrcat(temp,mealname_1st,12);break;	
			case 0x02:mystrcat(temp,mealname_2nd,14);break;		
			case 0x03:mystrcat(temp,mealname_3rd,14);break;	
			case 0x04:mystrcat(temp,mealname_4th,12);break;
			case 0x05:mystrcat(temp,mealname_5th,12);break;
			case 0x06:mystrcat(temp,mealname_6th,14);break;
			case 0x07:mystrcat(temp,mealname_7th,12);break;
			case 0x08:mystrcat(temp,mealname_8th,12);break;      
			default:break;			
		}
		Uart3_Sent(temp,sizeof(temp));	
}
 /*******************************************************************************
 * 函数名称:SyncMealCntDisp                                                                 
 * 描    述:数据同步时显示餐品数量  ，以文本方式显示                                                        
 *           更具floor 改变变量 ，meal_cnt 是要现实的数量                                                                    
 * 输    入:meal_id                                                                
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年3月13日                                                                    
 *******************************************************************************/ 							
void SyncMealCntDisp(uint8_t meal_cnt,uint8_t floor)							
{
	  char temp[20]={0};  //存放串口数据的临时数组
		char buffer[5]={0};
		int cnt_t=0,i=0;
		cnt_t= sprintf(buffer,"%d",meal_cnt);
		if(meal_cnt==0xff) cnt_t=0;
		memcpy(temp,VariableWrite,sizeof(VariableWrite));
		temp[2]= 4+cnt_t; //0x83 0x00 0x41 0x00 0x00 0x00 0x00 
		myunion.adress= sync_column1st_number+ floor*(0x0100); 
		temp[4]= myunion.adr[1];
		temp[5]= myunion.adr[0];
		for(i=0;i<cnt_t;i++) temp[i+6]=buffer[i]; 
		Uart3_Sent(temp,sizeof(temp));	
}

 /*******************************************************************************
 * 函数名称:AbnomalMealNameDisp                                                                  
 * 描    述:错误记录时显示餐品名称                                                          
 *           根据ID 显示名称 ，根据floor 改变现实变量的地址                                                                    
 * 输    入:meal_id ,floor                                                               
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年5月9日                                                                    
 *******************************************************************************/ 							
void AbnomalMealNameDisp(uint8_t meal_id,uint8_t floor)							
{
	  char temp[30]={0};  //存放串口数据的临时数组
		memcpy(temp,VariableWrite,sizeof(VariableWrite));
		temp[2]= 17; //0x83 0x41 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00
		myunion.adress= record_column1st_name+ floor*(0x0100); 
		temp[4]= myunion.adr[1];
		temp[5]= myunion.adr[0];
		switch(meal_id)
		{
			case 0x00:break;
			case 0x01:mystrcat(temp,mealname_1st,12);break;	
			case 0x02:mystrcat(temp,mealname_2nd,14);break;		
			case 0x03:mystrcat(temp,mealname_3rd,14);break;	
			case 0x04:mystrcat(temp,mealname_4th,12);break;
			case 0x05:mystrcat(temp,mealname_5th,12);break;
			case 0x06:mystrcat(temp,mealname_6th,14);break;
			case 0x07:mystrcat(temp,mealname_7th,12);break;
			case 0x08:mystrcat(temp,mealname_8th,12);break;      
			default:break;			
		}
		Uart3_Sent(temp,sizeof(temp));	
}

/*******************************************************************************
 * 函数名称:AbnomalMealCnttDisp                                                                 
 * 描    述:错误记录时显示餐品数量  ，以文本方式显示                                                        
 *           更具floor 改变变量 ，meal_cnt 是要现实的数量                                                                    
 * 输    入:meal_id                                                                
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年3月13日                                                                    
 *******************************************************************************/ 							
void AbnomalMealCnttDisp(uint8_t meal_cnt,uint8_t floor)							
{
	  char temp[20]={0};  //存放串口数据的临时数组
		char buffer[5]={0};
		int cnt_t=0,i=0;
		cnt_t= sprintf(buffer,"%d",meal_cnt);
		if(meal_cnt==0xff) cnt_t=0;
		memcpy(temp,VariableWrite,sizeof(VariableWrite));
		temp[2]= 4+cnt_t; //0x83 0x00 0x41 0x00 0x00 0x00 0x00 
		myunion.adress= record_column1st_cnt_t+ floor*(0x0100); 
		temp[4]= myunion.adr[1];
		temp[5]= myunion.adr[0];
		for(i=0;i<cnt_t;i++) temp[i+6]=buffer[i]; 
		Uart3_Sent(temp,sizeof(temp));	
}

/*******************************************************************************
 * 函数名称:AbnomalMealCntDisp                                                                 
 * 描    述:错误记录时显示餐品数量  ，以文本方式显示                                                        
 *           更具floor 改变变量 ，meal_cnt 是要现实的数量                                                                    
 * 输    入:meal_id                                                                
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年3月13日                                                                    
 *******************************************************************************/ 							
void AbnomalMealCntDisp(uint8_t meal_cnt,uint8_t floor)							
{
	  char temp[20]={0};  //存放串口数据的临时数组
		char buffer[5]={0};
		int cnt_t=0,i=0;
		cnt_t= sprintf(buffer,"%d",meal_cnt);
		if(meal_cnt==0xff) cnt_t=0;
		memcpy(temp,VariableWrite,sizeof(VariableWrite));
		temp[2]= 4+cnt_t; //0x83 0x00 0x41 0x00 0x00 0x00 0x00 
		myunion.adress= record_column1st_cnt+ floor*(0x0100); 
		temp[4]= myunion.adr[1];
		temp[5]= myunion.adr[0];
		for(i=0;i<cnt_t;i++) temp[i+6]=buffer[i]; 
		Uart3_Sent(temp,sizeof(temp));	
}
 /*******************************************************************************
 * 函数名称:DisplayTimeCutDown                                                                    
 * 描    述:显示离售餐时间的倒计时                                                            
 *                                                                               
 * 输    入:无                                                                     
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年7月22日                                                                    
 *******************************************************************************/ 
uint32_t sellsecond_remain=0;
void DisplayTimeCutDown(void)
{
  uint32_t sellsecond_totoal=0,realsecond_totoal=0;
	RTC_TimeShow();	//获取当前的时间
  sellsecond_totoal= selltime_hour*3600+selltime_minute*60; //设置售餐的时间换位秒
  realsecond_totoal= TimeDate.Hours*3600+TimeDate.Minutes*60+TimeDate.Senconds; //当前时间转换为秒
  if(sellsecond_totoal>realsecond_totoal)  
  {
    sellmeal_flag= false;
    sellsecond_remain = sellsecond_totoal-realsecond_totoal;
    selltime_hour_r= sellsecond_remain/3600;
    selltime_minute_r= (sellsecond_remain%3600)/60;
    selltime_second_r= (sellsecond_remain%3600)%60;
    VariableChage(wait_sellmeal_hour,selltime_hour_r);
    VariableChage(wait_sellmeal_minute,selltime_minute_r);
    VariableChage(wait_sellmeal_second,selltime_second_r);
    PageChange(SellMeal_TimeWait_interface); 
    OpenTIM4(); 
  }
  else
  {
    sellsecond_remain=0;
    CloseTIM4();
    sellmeal_flag= true;
    PageChange(Menu_interface); 
  }
}
 /*******************************************************************************
 * 函数名称:DisplayRecordTime                                                                     
 * 描    述:显示出错时的错误记录                                                              
 *                                                                               
 * 输    入:无                                                                     
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年5月23日                                                                    
 *******************************************************************************/  
char record_time[20]={"20yy-mm-dd hh:mm:ss"};
void DisplayRecordTime(void)
{ 
	  char temp[30]={0};  //存放串口数据的临时数组  
		RTC_TimeShow();     /*时间作为错误记录时间*/
		record_time[0] =    20/10+'0'; 
		record_time[1] =    20%10 +'0'; 
		record_time[2] =    TimeDate.Year/10+ '0'; 
		record_time[3] =    TimeDate.Year%10+ '0' ;
		record_time[5] =    TimeDate.Month/10+ '0';
		record_time[6] =    TimeDate.Month%10+ '0';
		record_time[8] =    TimeDate.Date/10+ '0'; 
		record_time[9] =    TimeDate.Date%10+ '0';
		record_time[11] =   TimeDate.Hours/10+ '0';
		record_time[12] =   TimeDate.Hours%10+ '0';
		record_time[14] =   TimeDate.Minutes/10+ '0';
		record_time[15] =   TimeDate.Minutes%10+ '0' ;
		record_time[17] =   TimeDate.Senconds/10+ '0'; 
		record_time[18] =   TimeDate.Senconds%10+ '0';	
		memcpy(temp,VariableWrite,sizeof(VariableWrite));
		temp[2]= 23; //22 0x83 0x41 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00
		myunion.adress= record_UserDataTime;
		temp[4]= myunion.adr[1];
		temp[5]= myunion.adr[0];
		mystrcat(temp,record_time,20);
		Uart3_Sent(temp,sizeof(temp));	
}
 /*******************************************************************************
 * 函数名称:DisplayUserRecord                                                                     
 * 描    述:显示出错时的错误记录                                                              
 *               需要修改                                                                
 * 输    入:无                                                                     
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年5月9日                                                                    
 *******************************************************************************/  
void DisplayUserRecord(void)
{
	uint8_t floor=0;
	for(floor=0;floor<4;floor++)		//清楚屏幕数据
	{
		AbnomalMealNameDisp(0,floor);
		AbnomalMealCnttDisp(0xff,floor);
		AbnomalMealCntDisp(0xff,floor);		
	}
	floor=0; //复原
	if(UserActMessageWriteToFlash.UserAct.MealCnt_1st_t>0)  
	{
		AbnomalMealNameDisp(UserActMessageWriteToFlash.UserAct.MealType_1st,floor);
		AbnomalMealCnttDisp(UserActMessageWriteToFlash.UserAct.MealCnt_1st_t,floor);
		AbnomalMealCntDisp(UserActMessageWriteToFlash.UserAct.MealCnt_1st,floor);		
		floor++;
	}
	if(UserActMessageWriteToFlash.UserAct.MealCnt_2nd_t>0)
	{
		AbnomalMealNameDisp(UserActMessageWriteToFlash.UserAct.MealType_2nd,floor);
		AbnomalMealCnttDisp(UserActMessageWriteToFlash.UserAct.MealCnt_2nd_t,floor);
		AbnomalMealCntDisp(UserActMessageWriteToFlash.UserAct.MealCnt_2nd,floor);	
		floor++;
	}
	if(UserActMessageWriteToFlash.UserAct.MealCnt_3rd_t>0)
	{
		AbnomalMealNameDisp(UserActMessageWriteToFlash.UserAct.MealType_3rd,floor);
		AbnomalMealCnttDisp(UserActMessageWriteToFlash.UserAct.MealCnt_3rd_t,floor);
		AbnomalMealCntDisp(UserActMessageWriteToFlash.UserAct.MealCnt_3rd,floor);	
		floor++;
	}
	if(UserActMessageWriteToFlash.UserAct.MealCnt_4th_t>0)
	{
		AbnomalMealNameDisp(UserActMessageWriteToFlash.UserAct.MealType_4th,floor);
		AbnomalMealCnttDisp(UserActMessageWriteToFlash.UserAct.MealCnt_4th_t,floor);
		AbnomalMealCntDisp(UserActMessageWriteToFlash.UserAct.MealCnt_4th,floor);	
		floor++;
	}
		//显示用户已付 和  应退  和 已退
	VariableChage(record_UserActPayAlready,UserActMessageWriteToFlash.UserAct.PayAlready);
		//应退的钱 = 总的应该退币的钱
	VariableChage(record_UserActPayBack,UserActMessageWriteToFlash.UserAct.MoneyBackShould);
	  //已退的钱 = 总的应该退币的钱- 还未退的钱
	VariableChage(record_UserActPayBackAlready,UserActMessageWriteToFlash.UserAct.MoneyBackShould-UserActMessageWriteToFlash.UserAct.MoneyBack);
}
	
