jackeyjiang/STM32_DGUS/STM32_Demo/utilities/serialscreen/serialscreen.c
 /*******************************************************************************
 * 函数名称:GetPassWord                                                                     
 * 描    述:放餐密码                                                            
 *                                                                               
 * 输    入:无                                                                     
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年4月9日                                                                    
 *******************************************************************************/  
void GetPassWord(unsigned char *PassWord)
{
  PassWord[0] = 5;
	PassWord[1] = 1;
	PassWord[2] = 8;
	PassWord[3] = 5;
	PassWord[4] = 1;
	PassWord[5] = 8;
}
 /*******************************************************************************
 * 函数名称:GetAdminPassWord                                                                     
 * 描    述:硬币退币与装填密码                                                           
 *                                                                               
 * 输    入:无                                                                     
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年8月13日                                                                    
 *******************************************************************************/  
void GetAdminPassWord(unsigned char *PassWord)
{
  PassWord[0] = 1;
	PassWord[1] = 2;
	PassWord[2] = 3;
	PassWord[3] = 4;
	PassWord[4] = 5;
	PassWord[5] = 6;
}
 /*******************************************************************************
 * 函数名称:GetUserPassword                                                                     
 * 描    述:错误记录清楚密码                                                         
 *                                                                               
 * 输    入:无                                                                     
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年8月13日                                                                    
 *******************************************************************************/  
void GetUserPassWord(unsigned char *PassWord)
{
  PassWord[0] = 6;
	PassWord[1] = 6;
	PassWord[2] = 6;
	PassWord[3] = 6;
	PassWord[4] = 6;
	PassWord[5] = 6;  
}
 /*******************************************************************************
 * 函数名称:VerifyPassword                                                                   
 * 描    述:数组比较                                                                 
 *                                                                               
 * 输    入:数组指针1，数组指针2，需比较的长度                                                                    
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年4月9日                                                                     
 *******************************************************************************/  
uint8_t VerifyPassword( uint8_t *Src1, uint8_t *Src2, uint8_t Length)
{
  uint8_t i = 0; 
	for(i = 0; i < Length; i++)
	{
	  if(*(Src1+i) != *(Src2+i))
		{
		    return 0;
		}
	}
	return 1;
}

 /*******************************************************************************
 * 函数名称:RecRegisterValues                                                                   
 * 描    述:获取寄存器的值                                                                                                                          
 * 输    入:寄存器地址,寄存器数据,寄存器数据长度                                                                  
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年6月24日                                                                   
 *******************************************************************************/ 
char current_page =0;//当前页面
void RecRegisterValues(char VariableAdress,char *VariableData,char length)
{
	if(VariableAdress==PIC_ID)//读取判断当前的页面的ID
	{
		current_page =VariableData[length-1];
		if(current_page!=pageunitil)
		{
			//PageChange(cmd_page);
    }
  }
}

 /*******************************************************************************
 * 函数名称:ChangeVariableValues                                                                   
 * 描    述:改变数据变量的值                                                                                                                          
 * 输    入:变量地址,变量数据,变量长度                                                                  
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年3月13日                                                                   
 *******************************************************************************/ 
char meal1st_cnt_t= 0,chicken_cnt_t= 0,duck_cnt_t= 0,fish_cnt_t= 0; /*临时数量*/
uint8_t  PassWordLen=0;	//密码的长度为0
uint8_t  PassWord[6]={0};
uint8_t  InputPassWord[6]={0};
bool cardbalence_cancel_flag= false;
bool mealneed_sync = false;  //餐品同步标记
int16_t CoinTotoal_t=0; //作为基数 		
int8_t	selltime_hour= 11,selltime_hour_t=11,selltime_hour_r=0;
int8_t	selltime_minute=30, selltime_minute_t=30,selltime_minute_r=0;
int8_t  selltime_second_r=0;
bool sellmeal_flag = true;
void ChangeVariableValues(int16_t VariableAdress,char *VariableData,char length)
{
	uint8_t i= 0,j=0;
	  switch (VariableAdress)
		{
			case meal_choose: /*主角面用户选择*/
			{ 
				//如果是按的是管理用户按键的话，直接弹出密码对话框，break
				if(VariableData[1]==0x0f) 
				{
					PageChange(Password_interface); 
					break;
				}	
				//在这里根据四个按键的返回值，结合套餐判断是哪一个ID
				else
				{
          //需要加入当没有餐品的时候，不跳入选餐界面
				  UserActMessageWriteToFlash.UserAct.MealID= sell_type[VariableData[1]-1];
          if(DefineMeal[UserActMessageWriteToFlash.UserAct.MealID-1].MealCount > 0)	   //判断餐品是否大于0
          {
            SearchMeal(UserActMessageWriteToFlash.UserAct.MealID ,1); 
            WaitTimeInit(&WaitTime);
            OpenTIM3();
            PageChange(MealNumChoose_interface);//显示相应界面
            PlayMusic(VOICE_1);
				  }
        }
			}break;      				
			case meal_choose_cnt: /*当前餐品的份数选择*/
			{
        //pageunitil = MealNumChoose_interface;
				if(VariableData[1]<= DefineMeal[UserActMessageWriteToFlash.UserAct.MealID-1].MealCount)	//设置餐品选择的上限
				{
          PageChange(MealNumChoose_interface+VariableData[1]); //切换到选了几个餐品
					SearchMeal(UserActMessageWriteToFlash.UserAct.MealID ,VariableData[1]); //查找当前的餐品ID是否在用户已选的餐品中			
				}
				else
				{
					PageChange(MealNumChoose_interface+ DefineMeal[UserActMessageWriteToFlash.UserAct.MealID-1].MealCount); //切换到选了几个餐品
					SearchMeal(UserActMessageWriteToFlash.UserAct.MealID ,DefineMeal[UserActMessageWriteToFlash.UserAct.MealID-1].MealCount); //查找当前的餐品ID是否在用户已选的餐品中			          
				}	 						 
			}break;     
      case mealcnt_choose:/*单页选择按钮*/
      {
			  switch(VariableData[1])
				{
					case 0x01:  /*放入购物车*/
					{
								
					}break;
					case 0x02:  /*继续选餐*/
					{
            PutIntoShopCart(); //需要修改
						PageChange(Menu_interface);
						WaitTimeInit(&WaitTime);
					}break;
 					case 0x03:  /*进入购物车*/
					{
            if(sellmeal_flag)
            {
              PutIntoShopCart();
              SettleAccounts();
              AcountCopy();
              if(UserActMessageWriteToFlash.UserAct.Meal_totoal>0)
              {  
                CloseTIM3();
                WaitTimeInit(&WaitTime);
                OpenTIM7();
                Current= waitfor_money;//进入读钱界面
                CurrentPoint= 1;       //倒计时60s，打开现金接受
                PlayMusic(VOICE_2);
              }
            }
            else
            {
              PageChange(SellMeal_TimeWait_interface);
            }
					}break;
					case 0x04:  /*取消*/
					{
						//清空所有的用户数据???
						ClearUserBuffer();
            SaveUserData();
						PageChange(Menu_interface);
						CloseTIM3();
						Current= current_temperature;//取消进入空闲程序
					}break;
					default:break;
				}
			}break;
			case payment_method: /*付款方式*/ 
			{
        uint32_t temp1= 0,temp2= 0;
				if(UserActMessageWriteToFlash.UserAct.PayShould==0) goto loop7;
				switch(VariableData[1])
				{
					case 0x01:   /*现金支付*/
					{
            if(cash_limit_flag==true) break; //如果零钱找完，无法进入
            PageChange(PayWithCash_interface);
						CurrentPoint =2;
            PlayMusic(VOICE_3);
						if(!OpenCashSystem()){OpenCashSystem();};// printf("cash system is erro2");  //关闭现金接受
					}break;
					case 0x02:   /*银行预付卡*/
					{
						CurrentPoint =7;
						PlayMusic(VOICE_5);
						if(!CloseCashSystem()){CloseCashSystem();};// printf("cash system is erro3");  //关闭现金接受
					}break;
					case 0x03:   /*深圳通支付*/
					{
						CurrentPoint =8;
						PlayMusic(VOICE_5);
						if(!CloseCashSystem()){CloseCashSystem();};//printf("cash system is erro4");  //关闭现金接受			
					}break;
          case 0x04:   /*会员卡支付*/
          {
          }break;      
					case 0x05:   /*取消*/
					{
	 loop7:		temp1= UserActMessageWriteToFlash.UserAct.MoneyBack= UserActMessageWriteToFlash.UserAct.PayAlready; //超时将收到的钱以硬币的形式返还
	          temp2= UserActMessageWriteToFlash.UserAct.MoneyBackShould = UserActMessageWriteToFlash.UserAct.PayAlready; //总的应该退的钱
            ClearUserBuffer();
            UserActMessageWriteToFlash.UserAct.MoneyBack= temp1;
            UserActMessageWriteToFlash.UserAct.MoneyBackShould= temp2;
            SaveUserData();
			      if(!CloseCashSystem()){CloseCashSystem();};//printf("cash system is erro5");  //关闭现金接受
            PageChange(Menu_interface);
						CloseTIM3();
						CloseTIM7();
						CurrentPoint = 0 ;
            if(UserActMessageWriteToFlash.UserAct.MoneyBack>0) //当有钱需要退的时候，标记用户取消购买，无需退币的时候直接进入温度显示状态
            {
              UserActMessageWriteToFlash.UserAct.Cancle= 0x01;
						  Current= hpper_out; 
            }
            else
            {              
              Current= current_temperature; 
            }
					}break;
					default:break;		
				}					
			}break;
			case caedbalence_cancel:/*刷卡取消*/
			{
				cardbalence_cancel_flag=true;
			}break;      
			case bill_print:
			{
				switch(VariableData[1])
				{
					case 0x01:   /*打印小票*/
          {
            if(UserActMessageWriteToFlash.UserAct.PrintTick==0x00000000)
            {
              UserActMessageWriteToFlash.UserAct.PrintTick= 0x00000001;
              PrintTickFun(&UserActMessageWriteToFlash.UserAct.PrintTick);
              CloseTIM4();
            }              
          }break;
					case 0x02:   /*不打印小票*/
					{
            if(UserActMessageWriteToFlash.UserAct.PrintTick==0x00000000)
            {
              UserActMessageWriteToFlash.UserAct.PrintTick= 0x00000002;
              PrintTickFun(&UserActMessageWriteToFlash.UserAct.PrintTick);
              CloseTIM4();				
            }
					}break;  
					default:break;
				}
			}break;
			case password:
			{
				switch(VariableData[1])
				{
					case 0x00:
					case 0x01:
					case 0x02:
					case 0x03:
					case 0x04:
					case 0x05:
					case 0x06:
					case 0x07:
					case 0x08:
					case 0x09:
					case 0x0A:						
					case 0x0B:
					case 0x0C:
					case 0x0D:
					case 0x0E:
					case 0x0F:
					{
	          if(PassWordLen < 6)
		        {
		          InputPassWord[PassWordLen] = (VariableData[1]);
		          PassWordLen++;
			        DisplayPassWord(PassWordLen);//显示一个字符串******
		        }
	        }break;					
					case 0x10:/*退格键*/
					{
	          if(PassWordLen > 0)
		        {
	            InputPassWord[PassWordLen] = 0;
	            PassWordLen--;
		          DisplayPassWord(PassWordLen);
		        }
					}break;
					case 0x11:/*确认件*/ //需要加入超级密码
					{
	          GetPassWord(PassWord);
    	      if(VerifyPassword(PassWord, InputPassWord,6) == 1) //放餐密码正确
		        {
							PassWordLen = 0;		
							DisplayPassWord(0);//清楚密码显示
							memset(InputPassWord,0,6);
						  if(Current== 0x00) 
						  {
							  break;
						  }              
						  if(erro_record!=0) 
						  {
							  break;
						  }							
							//如果有错误标记则break;
		           /*进入餐品放置界面*/
		           PageChange(MealSet_interface);					 
							 InitSetting();//清空第一二三列的数据 //对放餐的数据进行初始化
			         break;
		        }
						GetAdminPassWord(PassWord);//硬币设置密码
    	      if(VerifyPassword(PassWord, InputPassWord,6) == 1) 
		        {
							//进入管理员功能设置，设置硬币设置界面
		           /*进入管理员界面*/
							memset(InputPassWord,0,6);	
              DisplayPassWord(0);//清楚密码显示
              PassWordLen = 0;
						  if(Current== 0x00) 
						  {
							  break;
						  }
						  if(erro_record!=0) 
						  {
							  break;
						  }              
               VariableChage(coins_in,CoinsTotoalMessageWriteToFlash.CoinTotoal);//显示机内硬币总数
               VariableChage(coins_input,0);//显示放币数
               VariableChage(coins_retain,coins_remain);//保留硬币数
               VariableChage(coins_back,0); //显示退币数
               PageChange(Coinset_interface);
               //当前退币数
               break;
		        }
            GetUserPassWord(PassWord);   //出错数据显示密码
            if(VerifyPassword(PassWord, InputPassWord,6) == 1) 
            {
               memset(InputPassWord,0,6);
               DisplayPassWord(0);//清楚密码显示
               PassWordLen = 0;	
               if(erro_record!=0)
               {
                 if(!((erro_record&1<<arm_limit)||(erro_record&1<<signin_erro)||erro_record&1<<network_erro))
                   DisplayUserRecord();
                 PageChange(UserAbonamalRecord_interface);
               }                 
               break;              
            }
		        else
		        {
		          /*密码验证错误，进入密码输入界面*/   
							 DisplayPassWord(0);	
               PageChange(Password_interface);						
			         PassWordLen = 0;
		        }						
	        }break;						
					case 0x12:/*返回*/
					{
						if(erro_record!=0) //有错误的时候只能返回到错误界面
						{
						  PageChange(Err_interface);
							break;
						}								
		        PageChange(Menu_interface);
						DisplayPassWord(0);//清楚密码显示
		        PassWordLen = 0;	
					}break;
          default:break;					
        } 					
			}break;
			case record_clear:
			{
				switch(VariableData[1])
			  {
					case 0x01: //清除数据
					{
						erro_flag=0; //清除数据标记,数据清除在AbnormalHandle函数里
						if(Current==current_temperature)//限定在初始化状态
						{
							UserActMessageWriteToFlash.UserAct.MoneyBack=0;
							ClearUserBuffer();
					    SaveUserData();
							PageChange(Logo_interface);
						}
   				}break;
					case 0x02: //返回
					{
						PageChange(Err_interface);
					}break;
          default:break;
				}	
			}break;
			case admin_set:
			{
				switch(VariableData[1])
				{ 
					case 0x01:  /*温度设置按钮*/
					{
						PageChange(TemperatureSet_interface);
					}break;
					case 0x02:  /*餐品设置按钮 应该改为一键清空所有数据 */
					{
							for(i=0;i<90;i++)
	            {
	              FloorMealMessageWriteToFlash.FlashBuffer[i] = 0 ;
	            }
	            WriteMeal();  //写入餐品数据
							StatisticsTotal(); 
							DispLeftMeal();
					}break;
					case 0x03:	/*取消键*/
					{
						if(mealneed_sync == false)
						{
						  PageChange(Menu_interface);
						}
					}
          default:break;
				}					
			}break;
			case meal_num: //当改变餐品的编号的时候，需要查找当前的ID
			{
				uint8_t cnt_t=0;
        uint8_t meal_id_t=0,find_flag=0;
        for(meal_id_t=0;meal_id_t<4;meal_id_t++)
        {
          if(sell_type[VariableData[1]-1]==sell_type[meal_id_t]);            
            find_flag=1;
            break;
        }
        if(find_flag==1)
			    CurFloor.MealID= sell_type[VariableData[1]-1];	//当前的就是餐品的ID
        else
        {
          CurFloor.MealID= sell_type[0]; //当查不到输入的ID与本地的id不匹配则选最小号的ID
        }	
				InitSetting();
				for(cnt_t = 0; cnt_t < FloorMealNum; cnt_t++)  //查找那一层有是空的
				{
					if(FloorMealMessageWriteToFlash.FloorMeal[cnt_t].MealCount ==0)
					{
						 CurFloor.FloorNum = cnt_t+1;
						 break;
					}			
				}
				VariableChage(floor_num,CurFloor.FloorNum);				
			}break;
      case floor_num:
			{
			  CurFloor.FloorNum= VariableData[1];
				InitSetting();
			}break;
      case row_1st:
      {
				CurFloor.FCount= VariableData[1];
			}break;	
      case row_2nd:
      {
				CurFloor.SCount= VariableData[1];
			}break;	
      case row_3rd:
      {
				CurFloor.TCount= VariableData[1];
			}break;	
      case mealinput_choose:
			{
				switch(VariableData[1])
				{
					case 0x01:  /*放满*/
					{
						CurFloor.FCount = 3;
		        CurFloor.SCount = 3;
		        CurFloor.TCount = 3; 
		        CurFloor.MealCount = 9;
					  VariableChage(row_1st,CurFloor.FCount);
		        VariableChage(row_2nd,CurFloor.SCount);
		        VariableChage(row_3rd,CurFloor.TCount);	
					}break;
					case 0x02:  /*清空*/
					{
						CurFloor.FCount = 0;
		        CurFloor.SCount = 0;
		        CurFloor.TCount = 0; 
		        CurFloor.MealCount = 0;
					  VariableChage(row_1st,CurFloor.FCount);
		        VariableChage(row_2nd,CurFloor.SCount);
		        VariableChage(row_3rd,CurFloor.TCount);							
					}break;
					case 0x03:  /*确认*/
					{
						/*计算总共的餐品数*/
						CurFloor.MealCount=  CurFloor.FCount + CurFloor.SCount + CurFloor.TCount;
						/*把当前第一列设置的参数保存起来*/
						FloorMealMessageWriteToFlash.FloorMeal[CurFloor.FloorNum - 1].FCount    = CurFloor.FCount;
						/*把当前第2列设置的参数保存起来*/
						FloorMealMessageWriteToFlash.FloorMeal[CurFloor.FloorNum - 1].SCount    = CurFloor.SCount;
						/*把当前第3列设置的参数保存起来*/
						FloorMealMessageWriteToFlash.FloorMeal[CurFloor.FloorNum - 1].TCount    = CurFloor.TCount;
						/*把当前设置餐的ID号保存起来*/
						FloorMealMessageWriteToFlash.FloorMeal[CurFloor.FloorNum - 1].MealID    = CurFloor.MealID;
						/*把当前设置的餐的总数保存起来*/
						FloorMealMessageWriteToFlash.FloorMeal[CurFloor.FloorNum - 1].MealCount = CurFloor.MealCount;
						/*把设置餐的层数保存起来*/
						FloorMealMessageWriteToFlash.FloorMeal[CurFloor.FloorNum - 1].FloorNum  = CurFloor.FloorNum;
						/*九种菜品*/
						for(j = 0; j < MealKindTotoal; j++)	 //统计每个餐品的数据
						{
							/*各个餐的数目清零*/
							DefineMeal[j].MealCount = 0;
							/*各个餐的列对应的数目清零*/
							for(i = 0; i < FloorMealNum; i++)
							{
								DefineMeal[j].Position[i][0] = 0;
								DefineMeal[j].Position[i][1] = 0;
								DefineMeal[j].Position[i][2] = 0;
							}
							 /*统计各个餐的数目的总和*/
							for(i = 0; i < FloorMealNum; i++)
							{														 /*餐的ID是从1-6*/
								if(FloorMealMessageWriteToFlash.FloorMeal[i].MealID == j + 1)
								{
									DefineMeal[j].MealCount      = DefineMeal[j].MealCount + FloorMealMessageWriteToFlash.FloorMeal[i].MealCount;
									DefineMeal[j].Position[i][0] = FloorMealMessageWriteToFlash.FloorMeal[i].FCount;
									DefineMeal[j].Position[i][1] = FloorMealMessageWriteToFlash.FloorMeal[i].SCount;
									DefineMeal[j].Position[i][2] = FloorMealMessageWriteToFlash.FloorMeal[i].TCount;
									//printf("DefineMeal[%d].Position[%d][0]=%d\r\n",j,i,DefineMeal[j].Position[i][0]);
								}
							}
						}
						StatisticsTotal(); //先统计数目在写入
						WriteMeal(); //写数据到flash
						DispLeftMeal(); //更新餐品数据
						mealneed_sync = true;
						//printf("DefineMeal[%d].MealCount=%d\r\n",i,DefineMeal[i].MealCount);
					}break;
					case 0x04:  /*数据同步*/
					{
						uint8_t cnt_t=0,floor=0;
						for(cnt_t=0x00;cnt_t<0x04;cnt_t++)
						{
							/*显示餐品,数量*/									
              SyncMealNameDisp(0,cnt_t);
              SyncMealCntDisp(0xFF,cnt_t); 									 
						}	
						//禁止屏幕点击*/
            ScreenControl(ScreenDisable);
						/*餐品同步时尽量避免与服务器断开的情况*/
						/*不能加入签到函数，直接死掉*/
						//if(!SignInFunction())  AbnormalHandle(signin_erro);
						/*上传断网后的数据，供后台实时更新数据*/
            // SendtoServce(); //不要，因为没有用， 
						//数据同步子程序
						MealDataCompareFun();
						if(MealCompareData.MealCompareTotoal==0xFFFFFFFF) //正确
						 {
							 mealneed_sync = false;
							 PageChange(Data_synchronization);
							 for(cnt_t=0x00;cnt_t<0x04;cnt_t++)
							 {
									 /*显示餐品,数量*/									
                  SyncMealNameDisp(sell_type[cnt_t],floor);
                  SyncMealCntDisp(DefineMeal[sell_type[cnt_t]-1].MealCount,floor); 
                  floor++;									 
							 }							 
						 }
						 /*可以加入对比的返回值进行判断*/
             else
             {
							 mealneed_sync = true;
							 PageChange(Data_synchronization+2);
							 for(cnt_t=0x00;cnt_t<0x04;cnt_t++)
							 {
								 if(MealCompareData.MealComparePart[cnt_t]==0xff)
								 {
									//餐品同步成功不做任何事情 
								 }
								 else
								 {
									 /*显示餐品,数量*/									
                  SyncMealNameDisp(sell_type[cnt_t],floor);
                  SyncMealCntDisp(MealCompareData.MealComparePart[cnt_t],floor); 
                  floor++;									 
								 }
               }						 
						 }
						//超时时退出，错误退出
						ScreenControl(ScreenEnable);
						DispLeftMeal();//改变剩余餐品数量显示
					}break;
					case 0x05:  /*返回*/
					{
						CurFloor.FCount    = 0;
						CurFloor.SCount    = 0;
						CurFloor.TCount    = 0;
						CurFloor.MealID    = 0;
						CurFloor.MealCount = 0;
						CurFloor.FloorNum  = 0;	 
	          PageChange(MealSet_interface);
					}break;
					case 0x06: /*售餐设置*/
					{
            VariableChage(set_sellmeal_hour,selltime_hour);
            VariableChage(set_sellmeal_minute,selltime_minute);  
						PageChange(SellMeal_TimeSet_interface); 
					}break;
          case 0x07: /*餐品对比成功返回*/
          {
            PageChange(MealInput_interface);
          }break;
					default:break;	
				}
			}break;
			case temprature_set:
			{
        if(VariableData[1]==0xFF)
        {
          PageChange(MealSet_interface);
          VariableChage(temprature_set,0);
        }
        else
        {
          SetTemper(VariableData[1]);
        }
				
